Revit 2027 API
ParameterFilterUtilities.IsParameterApplicable Method
 Used to determine whether the element supports the given parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsParameterApplicable(
	Element element,
	ElementId parameter
)
Public Shared Function IsParameterApplicable (
	element As Element,
	parameter As ElementId
) As Boolean
public:
static bool IsParameterApplicable(
	Element^ element,
	ElementId^ parameter
)
static member IsParameterApplicable :
        element : Element *
        parameter : ElementId -> bool
Parameters
element Element
 The element to query for support of the given parameter.
parameter ElementId
 The parameter for which to query support.
Return Value
Boolean
 True if the element supports the given parameter, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 This operation is supported for external (e.g., shared, project) parameters only.
See Also
Reference
ParameterFilterUtilities Class
Autodesk.Revit.DB Namespace